## "Бесконечный ввод и подсчет положительных"

### Задание

С клавиатуры вводятся целые числа, до тех пор пока не будет введена строка "стоп". \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Вводятся целые числа, пока не будет введено "стоп".

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

```python
n = 0
positive_numbers = 0

while n != 'стоп':
    n = input('Введите целое число или "стоп": ')
    if n != 'стоп':
        if int(n) >= 0:
            positive_numbers += 1

print('Количество положительных чисел:', positive_numbers)
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотри пример "Выполнение цикла пока не будет введено нужное значение"
</details>
